In [1]:
import pandas as pd
import numpy as np

# GroupBy and Aggregation

In [13]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}
df = pd.DataFrame(data)

In [14]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [15]:
ls = 0
for i in df['Sales']:
    ls += i

In [16]:
ls

1500

In [17]:
# GroupBy category and Calculate the sum of sales

df.groupby('Category')['Sales'].sum()

Category
A    570
B    930
Name: Sales, dtype: int64

In [18]:
df.groupby('Store')['Sales'].sum()

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [8]:
df.groupby(['Category','Store'])['Sales'].sum()

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       430
Name: Sales, dtype: int64

In [9]:
df['Sales'].mean()

np.float64(187.5)

In [10]:
df['Sales'].agg(['sum','min','max','count','mean','median','std',])

sum       1500.000000
min        100.000000
max        300.000000
count        8.000000
mean       187.500000
median     190.000000
std         66.062741
Name: Sales, dtype: float64

# Pivot Tables

In [21]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    614     85   John  January      Q1
1  2023-01-02       B   West    229     48   Mary  January      Q1
2  2023-01-03       C  North    445     48    Bob  January      Q1
3  2023-01-04       D  South    516     71  Alice  January      Q1
4  2023-01-05       A   East    335     59   John  January      Q1
5  2023-01-06       B   West    603     69   Mary  January      Q1
6  2023-01-07       C  North    139     86    Bob  January      Q1
7  2023-01-08       D  South    928     24  Alice  January      Q1
8  2023-01-09       A   East    388     53   John  January      Q1
9  2023-01-10       B   West    356     49   Mary  January      Q1
10 2023-01-11       C  North    246     83    Bob  January      Q1
11 2023-01-12       D  South    469     10  Alice  January      Q1
12 2023-01-13       A   East    454     28   John  January      Q1
13 2023-01-14       B   West    683     46   Mary  January      Q1
14 2023-01-15       C  North    210     91    Bob  January      Q1
15 2023-01-16       D  South    986     48  Alice  January      Q1
16 2023-01-17       A   East    501     97   John  January      Q1
17 2023-01-18       B   West    235     87   Mary  January      Q1
18 2023-01-19       C  North    878     87    Bob  January      Q1
19 2023-01-20       D  South    570     60  Alice  January      Q1

In [29]:
pd.pivot_table(df, values="Sales", index="Region", columns="Product", aggfunc="median")

Product      A      B      C      D
Region
East     454.0    NaN    NaN    NaN
North      NaN    NaN  246.0    NaN
South      NaN    NaN    NaN  570.0
West       NaN  356.0    NaN    NaN

In [35]:
pivot2 = pd.pivot_table(df, values=["Sales","Units"], index="Region", columns="Product")
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     458.4    NaN    NaN    NaN  64.4   NaN   NaN   NaN
North      NaN    NaN  383.6    NaN   NaN   NaN  79.0   NaN
South      NaN    NaN    NaN  693.8   NaN   NaN   NaN  42.6
West       NaN  421.2    NaN    NaN   NaN  59.8   NaN   NaN

**CrossTab**

In [38]:
pd.crosstab(df["Region"], df["Product"])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0

# Operations

In [39]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [40]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [41]:
df1['B'].apply(lambda x:x**2)

0     100
1     400
2     900
3    1600
4    2500
Name: B, dtype: int64

In [42]:
def square(x):
    return x**2

df1['B'].apply(square)

0     100
1     400
2     900
3    1600
4    2500
Name: B, dtype: int64